Revit 2027 API
ElectricalLoadClassification.ActualElectricalLoadLabel Property
 The name template for the actual load parameter on the load classification.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ActualElectricalLoadLabel { get; set; }
Public Property ActualElectricalLoadLabel As String
	Get
	Set
public:
property String^ ActualElectricalLoadLabel {
	String^ get ();
	void set (String^ value);
}
member ActualElectricalLoadLabel : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: actualElectricalLoadLabel is not a valid globalization format string.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace